{
  "context": "A detail-aware refinement framework using single-image diffusion and reinforcement learning enhances reference-guided image generation, improving detail preservation and consistency. Reference-guided image generationhas progressed rapidly, yet currentdiffusion modelsstill struggle to preserve fine-grained visual details when refining a generated image using a reference. This limitation arises becauseVAE-basedlatent compressioninherently discards subtle texture information, causing identity- and attribute-specific cues to vanish. Moreover, post-editing approaches that amplify local details based on existing methods often produce results inconsistent with the original image in terms of lighting, texture, or shape. To address this, we introduce , a detail-aware refinement framework that performs two consecutive stages of reference-driven correction to enhancepixel-level consistency. We first adapt asingle-image diffusion editorby fine-tuning it to jointly ingest the draft image and the reference image, enabling globally coherent refinement while maintaining structural fidelity. We then applyreinforcement learningto further strengthen localized editing capability, explicitly optimizing for detail accuracy and semantic consistency. Extensive experiments demonstrate that  significantly improvesreference alignmentandfine-grained detail preservation, producing faithful and visually coherent edits that surpass both open-source and commercial models on challenging reference-guided restoration benchmarks. Page:https://github.com/yaoliliu/OmniRefiner This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "OmniRefiner: Reinforcement-Guided Local Diffusion Refinement",
    "github_url": "https://github.com/yaoliliu/OmniRefiner",
    "huggingface_url": "https://huggingface.co/papers/2511.19990",
    "upvote": 3,
    "tags": [
      "image",
      "detail",
      "reference"
    ]
  }
}