{
  "context": "F-CoT, an input-centric approach inspired by cognitive psychology, reduces token usage in large language models by structuring context and focusing reasoning, maintaining accuracy on arithmetic problems. Recent large language models achieve strong reasoning performance by generating detailedchain-of-thought traces, but this often leads to excessive token use and high inference latency. Existing efficiency approaches typically focus on model-centric interventions, such asreinforcement learningorsupervised fine-tuning, to reduce verbosity. In contrast, we propose a training-free, input-centric approach. Inspired bycognitive psychology, we introduceFocused Chain-of-Thought (F-CoT), which separates information extraction from the reasoning process. F-CoT first organizes the essential information from a query into a concise, structured context and then guides the model to reason exclusively over this context. By preventingattentionto irrelevant details, F-CoT naturally produces shorterreasoning paths. On arithmetic word problems, F-CoT reduces generated tokens by 2-3x while maintaining accuracy comparable to standard zero-shot CoT. These results highlight structured input as a simple yet effective lever for more efficient LLM reasoning. We show that providing input information in a structured form substantially speeds up reasoning in LLMs. Happy to discuss any details. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "Focused Chain-of-Thought: Efficient LLM Reasoning via Structured Input Information",
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.22176",
    "upvote": 4,
    "tags": [
      "cot",
      "reasoning",
      "input"
    ]
  }
}