{
  "context": "Investigating different Chain-of-Thought designs in vision-language models reveals that concise grounding steps are most effective for improving generalizable visual reasoning across various tasks. We study how differentChain-of-Thought(CoT) designs affect the acquisition of the generalizablevisual reasoningability invision-language models(VLMs). WhileCoTdata, especially long orvisual CoTsuch as \"think with image\", has been widely used to supervise intermediate reasoning, it remains unclear why specificCoTdesigns help and which ones truly support generalizable reasoning. To systematically evaluate this, we focus on a controlledmaze-solving benchmarkwhere reasoning rules are fully visual, difficulty can be tuned by grid size, and all the intermediate steps can be automatically generated. UsingQwen2.5-VL-7Bunder a standardSFT-then-RLpipeline, we compare three representativeCoTformats: LanguageCoT,Grounding CoT(with spatial coordinate trajectories), andVisual CoT(with image manipulations). Our experiments reveal that visual and longerCoTmainly accelerate convergence but do not lift the final performance ceiling; conciseCoTcontaining only essential grounding steps outperforms longer traces; and, strikingly,CoTretaining only the minimal grounding results generalizes best across different maze sizes. We further validate these insights on other vision-centric tasks. These findings highlight a \"short is long\" effect and provide practical guidance for constructing more generalizable SFT datasets forvisual reasoning. We study how different Chain-of-Thought (CoT) designs affect the acquisition of the generalizable visual reasoning ability in vision-language models (VLMs). While CoT data, especially long or visual CoT such as \"think with image\", has been widely used to supervise intermediate reasoning, it remains unclear why specific CoT designs help and which ones truly support generalizable reasoning. To systematically evaluate this, we focus on a controlled maze-solving benchmark where reasoning rules are fully visual, difficulty can be tuned by grid size, and all the intermediate steps can be automatically generated. Using Qwen2.5-VL-7B under a standard SFT-then-RL pipeline, we compare three representative CoT formats: Language CoT, Grounding CoT (with spatial coordinate trajectories), and Visual CoT (with image manipulations). Our experiments reveal that visual and longer CoT mainly accelerate convergence but do not lift the final performance ceiling; concise CoT containing only essential grounding steps outperforms longer traces; and, strikingly, CoT retaining only the minimal grounding results generalizes best across different maze sizes. We further validate these insights on other vision-centric tasks. These findings highlight a \"short is long\" effect and provide practical guidance for constructing more generalizable SFT datasets for visual reasoning. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend Great work, thansk a lot! ·Sign uporlog into comment",
  "metadata": {
    "title": "Revisiting the Necessity of Lengthy Chain-of-Thought in Vision-centric Reasoning Generalization",
    "authors": [],
    "publication_year": 2025,
    "github_url": "https://github.com/Richar-Du/Revisiting-Visual-CoT",
    "huggingface_url": "https://huggingface.co/papers/2511.22586",
    "upvote": 6,
    "tags": [
      "visual cot",
      "reasoning across",
      "improving generalizable"
    ]
  }
}