{
  "context": "A novel framework, Split-then-Merge, improves generative video composition through unsupervised learning of foreground-background interactions, achieving state-of-the-art performance. We presentSplit-then-Merge(StM), a novel framework designed to enhance control ingenerative video compositionand address its data scarcity problem. Unlike conventional methods relying on annotated datasets or handcrafted rules, StM splits a large corpus of unlabeled videos intodynamic foregroundandbackground layers, then self-composes them to learn how dynamic subjects interact with diverse scenes. This process enables the model to learn the complexcompositional dynamicsrequired for realistic video generation. StM introduces a noveltransformation-aware trainingpipeline that utilizes amulti-layer fusionandaugmentationto achieveaffordance-aware composition, alongside anidentity-preservation lossthat maintains foreground fidelity during blending. Experiments show StM outperforms SoTA methods in both quantitative benchmarks and in humans/VLLM-based qualitative evaluations. More details are available at our project page: https://split-then-merge.github.io 🎥 Introducing Split-then-Merge: A new video composition framework! This approach enables the composition of any foreground video with any background video. Unlike conventional methods that rely on annotated datasets or handcrafted rules, Split-then-Merge (StM) splits a large unlabeled corpus of videos into dynamic foreground and background layers, then merges them to learn how dynamic subjects interact with diverse scenes. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "Layer-Aware Video Composition via Split-then-Merge",
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2511.20809",
    "upvote": 0,
    "tags": [
      "video",
      "stm",
      "merge"
    ]
  }
}