{
  "context": "POLARIS, a novel approach based on diffusion models, minimizes noise approximation errors during image inversion by treating the guidance scale as a step-wise variable, thus enhancing the quality and accuracy of image editing and restoration tasks. TheInversion-Denoising Paradigm, which is based ondiffusion models, excels in diverse image editing and restoration tasks. We revisit its mechanism and reveal a critical, overlooked factor inreconstruction degradation: theapproximate noise error. This error stems from approximating the noise at step t with the prediction at step t-1, resulting in severe error accumulation throughout the inversion process. We introduceProjection-Orthogonal Least Squares for Robust and Adaptive Inversion (POLARIS), which reformulates inversion from anerror-compensation probleminto anerror-origin problem. Rather than optimizing embeddings or latent codes to offset accumulated drift, POLARIS treats theguidance scaleω as a step-wise variable and derives a mathematically grounded formula to minimize inversion error at each step. Remarkably, POLARIS improvesinversion latent qualitywith just one line of code. With negligible performance overhead, it substantially mitigatesnoise approximation errorsand consistently improves the accuracy ofdownstream tasks. POLARIS reframes inversion from an error-compensation problem to an error-origin problem. Instead of optimizing embeddings or latents to counteract drift, we treat the guidance scale as a step-wise variable and derive a mathematically grounded rule that minimizes inversion error at each step. Concretely, we obtain a closed-form, per-timestep scale from an orthogonality condition between conditional/unconditional noise-change vectors, yielding a robust, plug-and-play dynamic schedule that can be dropped into standard DDIM inversion. POLARIS is thus complementary to prior pipelines: it preserves their modularity while replacing a brittle, fixed hyperparameter with an adaptive, theoretically justified control law. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "POLARIS: Projection-Orthogonal Least Squares for Robust and Adaptive Inversion in Diffusion Models",
    "github_url": "https://github.com/Chatonz/POLARIS",
    "huggingface_url": "https://huggingface.co/papers/2512.00369",
    "upvote": 0,
    "tags": [
      "inversion",
      "step",
      "error"
    ]
  }
}