{
  "context": "OpenREAD, a vision-language model-based framework, enhances autonomous driving through end-to-end reinforcement fine-tuning, improving both reasoning and planning. Recently,two-stage fine-tuningstrategies, e.g., acquiring essential driving knowledge throughsupervised fine-tuning(SFT) and further enhancingdecision-makingandplanningviareinforcement fine-tuning(RFT), have shown strong potential in advancing theknowledge-driven autonomous driving(AD) paradigm. However, the learning nature of SFT still limits thegeneralizationofreasoning, thereby constraining the full potential of driving performance. Meanwhile, current RFT approaches are primarily applied todownstream tasks, since scene understanding is an open-ended problem where corresponding rewards are difficult to quantify. To address these limitations, we proposeOpenREAD, an OPEN-endedREasoningreinforced vision-language model (VLM)-based autonomous driving (AD) framework that enablesend-to-end RFTacross the full spectrum from high-levelreasoningto low-level trajectoryplanning. Specifically, we begin by constructing large-scaleChain-of-Thought(CoT) annotations on open-source driving-related knowledge datasets, and employ the powerfulQwen3large language model(LLM) as thecriticin RFT to quantifyreasoningquality for open-ended questions duringreward modeling. Extensive experiments confirm that jointend-to-end RFTyields substantial improvements in both upstream anddownstream tasks, enablingOpenREADto achieve state-of-the-art performance onreasoningandplanning benchmarks. We proposed OpenREAD, a vision-language model tailored for autonomous driving by reinforcement learning with GRPO. Besides the trajectory planning, our OpenREAD is also capable of providing reasoning-enhanced response for open-ended scenario understanding, action analysis,etc. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "OpenREAD: Reinforced Open-Ended Reasoing for End-to-End Autonomous Driving with LLM-as-Critic",
    "github_url": "https://github.com/wyddmw/OpenREAD",
    "huggingface_url": "https://huggingface.co/papers/2512.01830",
    "upvote": 3,
    "tag1": "driving",
    "tag2": "open",
    "tag3": "autonomous"
  }
}