{
  "context": "A hierarchical control architecture combining learning-based locomotion and model-based balancing enhances humanoid stability with supernumerary limbs. The integration ofSupernumerary Limbs(SLs) on humanoid robots poses a significant stability challenge due to the dynamic perturbations they introduce. This thesis addresses this issue by designing a novelhierarchical control architectureto improve humanoid locomotion stability with SLs. The core of this framework is adecoupled strategythat combineslearning-based locomotionwithmodel-based balancing. The low-level component consists of a walking gait for aUnitree H1humanoid throughimitation learningandcurriculum learning. The high-level component actively utilizes the SLs fordynamic balancing. The effectiveness of the system is evaluated in aphysics-based simulationunder three conditions: baseline gait for an unladen humanoid (baseline walking), walking with a static SL payload (static payload), and walking with the activedynamic balancing controller(dynamic balancing). Our evaluation shows that thedynamic balancing controllerimproves stability. Compared to thestatic payloadcondition, the balancing strategy yields agait patterncloser to the baseline and decreases theDynamic Time Warping(DTW) distance of the CoM trajectory by 47\\%. The balancing controller also improves there-stabilizationwithin gait cycles and achieves a more coordinatedanti-phase patternofGround Reaction Forces(GRF). The results demonstrate that a decoupled, hierarchical design can effectively mitigate the internal dynamic disturbances arising from the mass and movement of the SLs, enabling stable locomotion for humanoids equipped with functional limbs. Code and videos are available here: https://github.com/heyzbw/HuSLs. Code and videos are available here:https://github.com/heyzbw/HuSLs. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "A Hierarchical Framework for Humanoid Locomotion with Supernumerary Limbs",
    "github_url": "https://github.com/heyzbw/HuSls",
    "huggingface_url": "https://huggingface.co/papers/2512.00077",
    "upvote": 0,
    "tags": [
      "balancing",
      "based",
      "walking"
    ]
  }
}