{
  "context": "A new deep learning framework learns spectral bases directly from unstructured data, eliminating the need for traditional operator selection and eigendecomposition, and providing a data-driven approach to geometry processing. We introduce a novel framework that directly learns aspectral basisforshape and manifold analysisfromunstructured data, eliminating the need for traditional operator selection, discretization, and eigensolvers. Grounded inoptimal-approximation theory, we train a network to decompose animplicit approximation operatorby minimizing thereconstruction errorin the learned basis over a chosen distribution ofprobe functions. For suitable distributions, they can be seen as an approximation of theLaplacian operatorand itseigendecomposition, which are fundamental ingeometry processing. Furthermore, our method recovers in a unified manner not only thespectral basis, but also theimplicit metric'ssampling densityand theeigenvaluesof the underlying operator. Notably, ourunsupervised methodmakes no assumption on the data manifold, such as meshing or manifold dimensionality, allowing it to scale to arbitrary datasets of any dimension. Onpoint cloudslying on surfaces in 3D andhigh-dimensional image manifolds, our approach yields meaningful spectral bases, that can resemble those of the Laplacian, without explicit construction of an operator. By replacing the traditional operator selection, construction, andeigendecompositionwith a learning-based approach, our framework offers a principled, data-driven alternative to conventional pipelines. This opens new possibilities ingeometry processingforunstructured data, particularly in high-dimensional spaces. We introduce a novel framework that directly learns a spectral basis for shape and manifold analysis from unstructured data, eliminating the need for traditional operator selection, discretization, and eigensolvers.Grounded in optimal-approximation theory, we train a network to decompose an implicit approximation operator by minimizing the reconstruction error in the learned basis over a chosen distribution of probe functions.For suitable distributions, they can be seen as an approximation of the Laplacian operator and its eigendecomposition, which are fundamental in geometry processing.Furthermore, our method recovers in a unified manner not only the spectral basis, but also the implicit metric's sampling density and theeigenvalues of the underlying operator.Notably, our unsupervised method makes no assumption on the data manifold, such as meshing or manifold dimensionality, allowing it to scale to arbitrary datasets of any dimension.On point clouds lying on surfaces in 3D and high-dimensional image manifolds, our approach yields meaningful spectral bases, that can resemble those of the Laplacian, without explicit construction of an operator.By replacing the traditional operator selection, construction, and eigendecomposition with a learning-based approach, our framework offers a principled, data-driven alternative to conventional pipelines. This opens new possibilities in geometry processing for unstructured data, particularly in high-dimensional spaces. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "paper_name": "Learning Eigenstructures of Unstructured Data Manifolds",
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.01103",
    "upvote": 4,
    "tag1": "operator",
    "tag2": "manifold",
    "tag3": "approximation"
  }
}