{
  "context": "Video4Spatial demonstrates that video diffusion models can perform complex spatial tasks using only visual data, achieving strong spatial understanding and generalization. We investigate whether video generative models can exhibit visuospatial intelligence, a capability central to human cognition, using only visual data. To this end, we present Video4Spatial, a framework showing thatvideo diffusion modelsconditioned solely on video-based scene context can perform complex spatial tasks. We validate on two tasks:scene navigation- following camera-pose instructions while remaining consistent with3D geometryof the scene, andobject grounding- which requiressemantic localization,instruction following, andplanning. Both tasks usevideo-only inputs, without auxiliary modalities such as depth or poses. With simple yet effective design choices in the framework and data curation, Video4Spatial demonstrates strong spatial understanding from video context: it plans navigation and grounds target objects end-to-end, follows camera-pose instructions while maintainingspatial consistency, and generalizes to long contexts and out-of-domain environments. Taken together, these results advance video generative models toward general visuospatial reasoning.  This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "title": "Video4Spatial: Towards Visuospatial Intelligence with Context-Guided Video Generation",
    "authors": [],
    "publication_year": 2025,
    "github_url": "",
    "huggingface_url": "https://huggingface.co/papers/2512.03040",
    "upvote": 5,
    "tags": [
      "visuospatial reasoning",
      "depth poses",
      "curation video4spatial"
    ]
  }
}