{
    "context": "SPARK, a synergistic policy and reward co-evolving framework, enhances LLMs and LVLMs by recycling rollouts and correctness data to train a generative reward model, reducing reliance on human preferences and external reward models. Recent Large Language Models (LLMs) and Large Vision-Language Models (LVLMs)\nincreasingly useReinforcement Learning(RL) for post-pretraining, such as RL\nwith Verifiable Rewards (RLVR) for objective tasks andRL from Human Feedback(RLHF) for subjective tasks. However, RLHF incurs high costs and potential\nreward-policy mismatch due to reliance on human preferences, while RLVR still\nwastes supervision by discardingrolloutsand correctness signals after each\nupdate. To address these challenges, we introduce the Synergistic Policy And\nReward Co-Evolving Framework (SPARK), an efficient,on-policy, and stable\nmethod that builds on RLVR. Instead of discardingrolloutsand correctness\ndata,SPARKrecycles this valuable information to simultaneously train the\nmodel itself as agenerative reward model. This auxiliary training uses a mix\nof objectives, such aspointwise reward score,pairwise comparison, and\nevaluation conditioned on further-reflection responses, to teach the model to\nevaluate and improve its own responses. Our process eliminates the need for a\nseparate reward model and costly human preference data.SPARKcreates a\npositive co-evolving feedback loop: improvedreward accuracyyields betterpolicy gradients, which in turn produce higher-qualityrolloutsthat further\nrefine the reward model. Our unified framework supports test-time scaling viaself-reflectionwithout external reward models and their associated costs. We\nshow thatSPARKachieves significantperformance gainson multiple LLM and LVLM\nmodels and multiple reasoning, reward models, andgeneral benchmarks. For\nexample,SPARK-VL-7B achieves an average 9.7% gain on 7reasoning benchmarks,\n12.1% on 2reward benchmarks, and 1.5% on 8general benchmarksover the\nbaselines, demonstrating robustness and broad generalization. Recent Large Language Models (LLMs) and Large Vision-Language Models (LVLMs) increasingly use Reinforcement Learning (RL) for post-pretraining, such as RL with Verifiable Rewards (RLVR) for objective tasks and RL from Human Feedback (RLHF) for subjective tasks. However, RLHF incurs high costs and potential reward-policy mismatch due to reliance on human preferences, while RLVR still wastes supervision by discarding rollouts and correctness signals after each update. To address these challenges, we introduce the Synergistic Policy And Reward Co-Evolving Framework (SPARK), an efficient, on-policy, and stable method that builds on RLVR. Instead of discarding rollouts and correctness data, SPARK recycles this valuable information to simultaneously train the model itself as a generative reward model. This auxiliary training uses a mix of objectives, such as pointwise reward score, pairwise comparison, and evaluation conditioned on further-reflection responses, to teach the model to evaluate and improve its own responses. Our process eliminates the need for a separate reward model and costly human preference data. SPARK creates a positive co-evolving feedback loop: improved reward accuracy yields better policy gradients, which in turn produce higher-quality rollouts that further refine the reward model. Our unified framework supports test-time scaling via self-reflection without external reward models and their associated costs. We show that SPARK achieves significant performance gains on multiple LLM and LVLM models and multiple reasoning, reward models, and general benchmarks. For example, SPARK-VL-7B achieves an average 9.7% gain on 7 reasoning benchmarks, 12.1% on 2 reward benchmarks, and 1.5% on 8 general benchmarks over the baselines, demonstrating robustness and broad generalization. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "SPARK: Synergistic Policy And Reward Co-Evolving Framework",
        "authors": [
            "Yuhang Zang",
            "Haodong Duan",
            "Jiaqi Wang"
        ],
        "publication_year": 2025,
        "github_url": "https://github.com/InternLM/Spark",
        "huggingface_url": "https://huggingface.co/papers/2509.22624",
        "upvote": 17
    }
}