{
    "context": "VGGT-X addresses VRAM and output quality issues in scaling 3D Foundation Models for dense Novel View Synthesis without relying on COLMAP. We study the problem of applying3D Foundation Models(3DFMs) to dense Novel\nView Synthesis (NVS). Despite significant progress inNovel View Synthesispowered byNeRFand3DGS, current approaches remain reliant on accurate 3D\nattributes (e.g., camera poses and point clouds) acquired fromStructure-from-Motion(SfM), which is often slow and fragile in low-texture or\nlow-overlap captures. Recent 3DFMs showcase orders of magnitude speedup over\nthe traditional pipeline and great potential for online NVS. But most of the\nvalidation and conclusions are confined to sparse-view settings. Our study\nreveals that naively scaling 3DFMs to dense views encounters two fundamental\nbarriers: dramatically increasing VRAM burden and imperfect outputs that\ndegrade initialization-sensitive 3D training. To address these barriers, we\nintroduceVGGT-X, incorporating amemory-efficientVGGT implementation that\nscales to 1,000+ images, anadaptive global alignmentfor VGGT output\nenhancement, androbust 3DGS trainingpractices. Extensive experiments show\nthat these measures substantially close the fidelity gap with\nCOLMAP-initialized pipelines, achieving state-of-the-art results in denseCOLMAP-free NVSandpose estimation. Additionally, we analyze the causes of\nremaining gaps with COLMAP-initialized rendering, providing insights for the\nfuture development of3D foundation modelsand dense NVS. Our project page is\navailable at https://dekuliutesla.github.io/vggt-x.github.io/ TL;DR: We present VGGT-X to explore what would happen if 3D Foundation Model is applied for dense Novel View Synthesis (NVS). It incorporates a memory-efficient VGGT implementation, an adaptive global alignment for VGGT output enhancement, and high-quality 3DGS training practices.Project Page:https://dekuliutesla.github.io/vggt-x.github.io/GitHub Repository:https://github.com/Linketic/VGGT-XarXiv:https://arxiv.org/abs/2509.25191 This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "VGGT-X: When VGGT Meets Dense Novel View Synthesis",
        "authors": [],
        "publication_year": 2025,
        "github_url": "https://github.com/Linketic/VGGT-X",
        "huggingface_url": "https://huggingface.co/papers/2509.25191",
        "upvote": 18
    }
}