{
    "context": "Flash-Searcher, a parallel agent reasoning framework using directed acyclic graphs, enhances efficiency and performance in complex reasoning tasks by enabling concurrent execution and dynamic workflow optimization. Large language models (LLMs) have demonstrated remarkable capabilities in\ncomplex reasoning tasks when equipped with external tools. However, current\nframeworks predominantly rely on sequential processing, leading to inefficient\nexecution particularly for tasks requiring extensive tool interaction. This\npaper introduces Flash-Searcher, a novelparallel agent reasoning frameworkthat fundamentally reimagines the execution paradigm from sequential chains todirected acyclic graphs (DAGs). Flash-Searcher decomposes complex tasks intosubtaskswithexplicit dependencies, enablingconcurrent executionof\nindependent reasoning paths while maintaining logical constraints. Throughdynamic workflow optimization, our framework continuously refines the execution\ngraph based on intermediate results, effectively integratingsummary module.\nComprehensive evaluations across multiple benchmarks demonstrate that\nFlash-Searcher consistently outperforms existing approaches. Specifically, it\nachieves 67.7% accuracy onBrowseCompand 83% onxbench-DeepSearch, while\nreducingagent execution stepsby up to 35% compared to current frameworks.\nFurthermore, whendistillingthis parallel reasoning pipeline into single\nmodels, we observe substantial performance gains across diverse backbone\narchitectures, underscoring the generalizability of our methodology. Our work\nthus represents a significant advance in agent architecture design, offering a\nmore scalable and efficient paradigm for complex reasoning tasks. Flash-Searcher is a novel parallel agent reasoning framework that uses DAGs to enable concurrent, dependency-aware task execution, significantly improving accuracy and efficiency over sequential approaches. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "Flash-Searcher: Fast and Effective Web Agents via DAG-Based Parallel\n  Execution",
        "authors": [
            "Ge Zhang"
        ],
        "publication_year": 2025,
        "github_url": "",
        "huggingface_url": "https://huggingface.co/papers/2509.25301",
        "upvote": 19
    }
}