{
    "context": "Hidden states in Large Language Models encode correctness as a separable signature, enabling a minimalist verifier (CLUE) to outperform text-level and confidence-based methods in reranking and accuracy. Assessing the quality ofLarge Language Model(LLM) outputs presents a\ncritical challenge. Previous methods either rely on text-level information\n(e.g., reward models, majority voting), which can overfit to superficial cues,\nor on calibrated confidence from token probabilities, which would fail on\nless-calibrated models. Yet both of these signals are, in fact, partial\nprojections of a richer source of information: the model's internal hidden\nstates. Early layers, closer totoken embeddings, preserve semantic and lexical\nfeatures that underpin text-based judgments, while later layers increasingly\nalign withoutput logits, embeddingconfidence-related information. This paper\nexploreshidden statesdirectly as a unified foundation for verification. We\nshow that the correctness of a solution is encoded as a geometrically separable\nsignature within the trajectory of hidden activations. To validate this, we\npresentClue(Clustering and Experience-based Verification), a deliberately\nminimalist, non-parametric verifier. With no trainable parameters,CLUEonly\nsummarizes each reasoning trace by an hidden state delta and classifies\ncorrectness vianearest-centroid distanceto ``success'' and ``failure''\nclusters formed from past experience. The simplicity of this method highlights\nthe strength of the underlying signal. Empirically,CLUEconsistently\noutperforms LLM-as-a-judge baselines and matches or exceeds modern\nconfidence-based methods in reranking candidates, improving both top-1 and\nmajority-vote accuracy acrossAIME24/25 andGPQA. As a highlight, onAIME24\nwith a 1.5B model,CLUEboosts accuracy from 56.7% (majority@64) to 70.0%\n(top-maj@16). This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "CLUE: Non-parametric Verification from Experience via Hidden-State\n  Clustering",
        "authors": [
            "Zhenwen Liang"
        ],
        "publication_year": 2025,
        "github_url": "",
        "huggingface_url": "https://huggingface.co/papers/2510.01591",
        "upvote": 26
    }
}