{
  "context": "A novel method disentangles visual and semantic features from diffusion model backbones to quantify and localize visual inconsistencies in subject-driven image generation. We propose a novel approach for disentangling visual andsemantic featuresfrom the backbones of pre-traineddiffusion models, enabling visual\ncorrespondence in a manner analogous to the well-established semantic\ncorrespondence. While diffusion model backbones are known to encode\nsemantically rich features, they must also containvisual featuresto support\ntheir image synthesis capabilities. However, isolating thesevisual featuresis\nchallenging due to the absence of annotated datasets. To address this, we\nintroduce an automated pipeline that constructsimage pairswith annotated\nsemantic and visual correspondences based on existing subject-driven image\ngeneration datasets, and design acontrastive architectureto separate the two\nfeature types. Leveraging the disentangled representations, we propose a new\nmetric,Visual Semantic Matching (VSM), that quantifies visual inconsistencies\ninsubject-driven image generation. Empirical results show that our approach\noutperforms global feature-based metrics such asCLIP,DINO, andvision--language modelsin quantifying visual inconsistencies while also\nenabling spatial localization of inconsistent regions. To our knowledge, this\nis the first method that supports both quantification and localization of\ninconsistencies in subject-driven generation, offering a valuable tool for\nadvancing this task. Project\nPage:https://abdo-eldesokey.github.io/mind-the-glitch/ NeurIPS 2025 (spotlight)Project Page:https://abdo-eldesokey.github.io/mind-the-glitch/ This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "title": "Mind-the-Glitch: Visual Correspondence for Detecting Inconsistencies in\n  Subject-Driven Generation",
    "authors": [
      "Abdelrahman Eldesokey"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/abdo-eldesokey/mind-the-glitch",
    "huggingface_url": "https://huggingface.co/papers/2509.21989",
    "upvote": 22,
    "tags": []
  }
}