{
  "context": "ExGRPO, a framework that prioritizes valuable reasoning experiences, improves and stabilizes reinforcement learning from verifiable rewards for large language models. Reinforcement learning from verifiable rewards(RLVR) is an emerging paradigm\nfor improving the reasoning ability of large language models. However, standardon-policy trainingdiscardsrollout experiencesafter a single update, leading\nto computational inefficiency and instability. While prior work on RL has\nhighlighted the benefits of reusing past experience, the role of experience\ncharacteristics in shaping learning dynamics of large reasoning models remains\nunderexplored. In this paper, we are the first to investigate what makes a\nreasoning experience valuable and identifyrollout correctnessandentropyas\neffective indicators of experience value. Based on these insights, we proposeExGRPO(Experiential Group Relative Policy Optimization), a framework that\norganizes and prioritizes valuable experiences, and employs a mixed-policy\nobjective to balanceexplorationwithexperience exploitation. Experiments on\nfive backbone models (1.5B-8B parameters) show thatExGRPOconsistently\nimprovesreasoning performanceon mathematical/general benchmarks, with an\naverage gain of +3.5/7.6 points over on-policyRLVR. Moreover,ExGRPOstabilizes training on both stronger and weaker models where on-policy methods\nfail. These results highlight principled experience management as a key\ningredient for efficient and scalableRLVR. We present a systematic study of what makes reasoning experiences valuable in RLVR and propose a framework that leverages these insights to exploit high-value experiences for efficient RLVR. Model Collection:https://huggingface.co/collections/rzzhan/exgrpo-68d8e302efdfe325187d5c96 Github:https://github.com/ElliottYan/LUFFY/tree/main/ExGRPO Added to the metadata. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
  "metadata": {
    "title": "ExGRPO: Learning to Reason from Experience",
    "authors": [
      "Runzhe Zhan"
    ],
    "publication_year": 2025,
    "github_url": "https://github.com/ElliottYan/LUFFY/tree/main/ExGRPO",
    "huggingface_url": "https://huggingface.co/papers/2510.02245",
    "upvote": 80,
    "tags": []
  }
}