{
    "context": "DataMind addresses challenges in building open-source data-analytic agents through task taxonomy, trajectory sampling, dynamic training objectives, and stable multi-turn rollouts, achieving state-of-the-art performance on data analysis benchmarks. Data-analytic agents are emerging as a key catalyst for automated scientific\ndiscovery and for the vision of Innovating AI. Current approaches, however,\nrely heavily on prompt engineering over proprietary models, while open-source\nmodels struggle to face diverse-format, large-scale data files and\nlong-horizon, multi-step reasoning that real-world analytics demands. This\npaper introduces DataMind, a scalable data synthesis and agent training recipe\ndesigned to build generalist data-analytic agents. DataMind tackles three key\nchallenges in building open-source data-analytic agents, including insufficient\ndata resources, improper training strategy, and unstable code-based multi-turn\nrollout. Concretely, DataMind applies 1) afine-grained task taxonomyand arecursive easy-to-hard task compositionmechanism to increase the diversity and\ndifficulty of synthesized queries; 2) aknowledge-augmented trajectory samplingstrategy followed by model-based andrule-based filtering; 3) a dynamically\nadjustable training objective combining bothSFTandRL losses; 4) amemory-frugaland stablecode-based multi-turn rolloutframework. Built on\nDataMind, we curateDataMind-12K, a high-quality trajectory set spanning\ndiverse domains, task categories, and data file formats for data-analytic\ntasks. Trained onDataMind-12K, ourDataMind-14Bachieves state-of-the-art with\nan average score of 71.16% on multiple data analysis benchmarks, outperforming\nthe strongest proprietary baselines DeepSeek-V3.1 and GPT-5. OurDataMind-7Balso performs best among all open-source models with a score of 68.10%. We also\nincorporate some empirical insights gained from our exploratory trials into the\nanalysis experiments, aiming to provide actionable insights about agentic\ntraining for the community. We will releaseDataMind-12KandDataMind-7B,14B\nfor the community's future research. This paper introduces DataMind, a scalable data synthesis and agent training recipe designed to build generalist data-analytic agents. This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "Scaling Generalist Data-Analytic Agents",
        "authors": [
            "Shuofei Qiao",
            "Ningyu Zhang"
        ],
        "publication_year": 2025,
        "github_url": "",
        "huggingface_url": "https://huggingface.co/papers/2509.25084",
        "upvote": 18
    }
}