{
    "context": "WebGen-Agent enhances website code generation by integrating visual feedback and GUI-agent testing with a backtracking mechanism and Step-GRPO training to improve accuracy and appearance scores. Agent systems powered bylarge language models(LLMs) have demonstrated\nimpressive performance on repository-level code-generation tasks. However, for\ntasks such aswebsite codebase generation, which depend heavily on visual\neffects and user-interaction feedback, current code agents rely only on simple\ncode execution for feedback and verification. This approach fails to capture\nthe actual quality of the generated code. In this paper, we propose\nWebGen-Agent, a novel website-generation agent that leverages comprehensive and\nmulti-levelvisual feedbackto iteratively generate and refine the website\ncodebase. Detailed and expressive text descriptions and suggestions regarding\nthe screenshots andGUI-agent testingof the websites are generated by a visual\nlanguage model (VLM), together with scores that quantify their quality. The\nscreenshot and GUI-agent scores are further integrated with abacktrackingandselect-best mechanism, enhancing the performance of the agent. Utilizing the\naccurate visual scores inherent in the WebGen-Agent workflow, we further\nintroduceStep-GRPOwith Screenshot and GUI-agent Feedback to improve\nthe ability ofLLMsto act as the reasoning engine of WebGen-Agent. By using\nthe screenshot and GUI-agent scores at each step as the reward inStep-GRPO, we\nprovide a dense and reliable process supervision signal, which effectively\nimproves the model's website-generation ability. On theWebGen-Bench dataset,\nWebGen-Agent increases the accuracy ofClaude-3.5-Sonnetfrom 26.4% to 51.9%\nand its appearance score from 3.0 to 3.9, outperforming the previous\nstate-of-the-art agent system. Additionally, ourStep-GRPOtraining approach\nincreases the accuracy ofQwen2.5-Coder-7B-Instructfrom 38.9% to 45.4% and\nraises the appearance score from 3.4 to 3.7. Code for agent inference and RL training is available atWebGen-Agent (github)Model weights and training data are available atWebGen-Agent (huggingface) This is an automated message from theLibrarian Bot. I found the following papers similar to this paper. The following papers were recommended by the Semantic Scholar API Please give a thumbs up to this comment if you found it helpful! If you want recommendations for any Paper on Hugging Face checkoutthisSpace You can directly ask Librarian Bot for paper recommendations by tagging it in a comment:@librarian-botrecommend ·Sign uporlog into comment",
    "metadata": {
        "title": "WebGen-Agent: Enhancing Interactive Website Generation with Multi-Level\n  Feedback and Step-Level Reinforcement Learning",
        "authors": [
            "Ke Wang"
        ],
        "publication_year": 2025,
        "github_url": "https://github.com/mnluzimu/WebGen-Agent",
        "huggingface_url": "https://huggingface.co/papers/2509.22644",
        "upvote": 20
    }
}