{
  "context": "The landscape of video generation is shifting, from a focus on generating visually appealing clips to building virtual environments that support interaction and maintainphysical plausibility. These developments point toward the emergence ofvideo foundation modelsthat function not only as visual generators but also asimplicit world models, models that simulate thephysical dynamics,agent-environment interactions, andtask planningthat govern real or imagined worlds. This survey provides a systematic overview of this evolution, conceptualizing modernvideo foundation modelsas the combination of two core components: an implicit world model and avideo renderer. The world model encodes structured knowledge about the world, including physical laws, interaction dynamics, and agent behavior. It serves as alatent simulationengine that enables coherentvisual reasoning, long-termtemporal consistency, andgoal-driven planning. Thevideo renderertransforms thislatent simulationinto realistic visual observations, effectively producing videos as a \"window\" into the simulated world. We trace the progression of video generation through four generations, in which the core capabilities advance step by step, ultimately culminating in a world model, built upon a video generation model, that embodies intrinsicphysical plausibility, real-timemultimodal interaction, and planning capabilities spanning multiplespatiotemporal scales. For each generation, we define its core characteristics, highlight representative works, and examine their application domains such as robotics, autonomous driving, and interactive gaming. Finally, we discuss open challenges and design principles for next-generation world models, including the role ofagent intelligencein shaping and evaluating these systems. An up-to-date list of related works is maintained at this link.",
  "metadata": {
    "paper_name": "Simulating the Visual World with Artificial Intelligence: A Roadmap",
    "github_url": "https://github.com/ziqihuangg/Awesome-From-Video-Generation-to-World-Model",
    "huggingface_url": "https://huggingface.co/papers/2511.08585",
    "upvote": "29",
    "tags": [
      "world",
      "generation",
      "model"
    ]
  }
}