{
  "context": "Innovative visual stylization is a cornerstone of artistic creation, yet generating novel and consistent visual styles remains a significant challenge. Existing generative approaches typically rely on lengthy textual prompts, reference images, or parameter-efficient fine-tuning to guide style-aware image generation, but often struggle with style consistency, limited creativity, and complex style representations. In this paper, we affirm that a style is worth one numerical code by introducing the novel task, code-to-style image generation, which produces images with novel, consistent visual styles conditioned solely on anumerical style code. To date, this field has only been primarily explored by the industry (e.g., Midjourney), with no open-source research from the academic community. To fill this gap, we propose CoTyle, the first open-source method for this task. Specifically, we first train adiscrete style codebookfrom a collection of images to extractstyle embeddings. These embeddings serve as conditions for atext-to-image diffusion model(T2I-DM) to generate stylistic images. Subsequently, we train anautoregressive style generatoron the discretestyle embeddingsto model their distribution, allowing the synthesis of novelstyle embeddings. During inference, anumerical style codeis mapped to a unique style embedding by the style generator, and this embedding guides the T2I-DM to generate images in the corresponding style. Unlike existing methods, our method offers unparalleled simplicity and diversity, unlocking a vast space of reproducible styles from minimal input. Extensive experiments validate that CoTyle effectively turns a numerical code into astyle controller, demonstrating a style is worth one code.",
  "metadata": {
    "paper_name": "A Style is Worth One Code: Unlocking Code-to-Style Image Generation with Discrete Style Space",
    "github_url": "https://github.com/Kwai-Kolors/CoTyle",
    "huggingface_url": "https://huggingface.co/papers/2511.10555",
    "upvote": "59",
    "tags": [
      "style",
      "code",
      "images"
    ]
  }
}