{
  "context": "Hospitals and healthcare systems rely on operational decisions that determine patient flow, cost, and quality of care. Despite strong performance on medical knowledge and conversational benchmarks,foundation modelstrained on general text may lack the specialized knowledge required for these operational decisions. We introduceLang1, a family of models (100M-7B parameters) pretrained on a specialized corpus blending 80Bclinical tokensfrom NYU Langone Health'sEHRsand 627B tokens from the internet. To rigorously evaluateLang1in real-world settings, we developed theREalistic Medical Evaluation(ReMedE), a benchmark derived from 668,331 EHR notes that evaluates five critical tasks:30-day readmission prediction,30-day mortality prediction,length of stay,comorbidity coding, and predictinginsurance claims denial. Inzero-shot settings, both general-purpose and specialized models underperform on four of five tasks (36.6%-71.7%AUROC), with mortality prediction being an exception. Afterfinetuning,Lang1-1B outperforms finetuned generalist models up to 70x larger and zero-shot models up to 671x larger, improvingAUROCby 3.64%-6.75% and 1.66%-23.66% respectively. We also observedcross-task scalingwith jointfinetuningon multiple tasks leading to improvement on other tasks.Lang1-1B effectively transfers to out-of-distribution settings, including other clinical tasks and an external health system. Our findings suggest that predictive capabilities for hospital operations require explicitsupervised finetuning, and that thisfinetuningprocess is made more efficient byin-domain pretrainingon EHR. Our findings support the emerging view thatspecialized LLMscan compete with generalist models in specialized tasks, and show that effective healthcare systems AI requires the combination ofin-domain pretraining,supervised finetuning, andreal-world evaluationbeyond proxy benchmarks.",
  "metadata": {
    "paper_name": "Generalist Foundation Models Are Not Clinical Enough for Hospital Operations",
    "github_url": null,
    "huggingface_url": "https://huggingface.co/papers/2511.13703",
    "upvote": "20",
    "tags": [
      "tasks",
      "models",
      "specialized"
    ]
  }
}